---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimStyleAngularUnits
source: html/052bda7e-d729-a015-cd47-236873750e62.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimStyleAngularUnits Property

"Units Format"

## Syntax (C#)
```csharp
public static ForgeTypeId DimStyleAngularUnits { get; }
```